[   
    {
        "date": "11-13-2025",
        "description": "I gave a lightning talk about our \"CrowdLLM\" paper at Amazon Scientific Exchange."
    },
    {
        "date": "11-10-2025",
        "description": "Our research was highlighted by UW College of Engineering .",
        "insrt":{
            "name": "News",
            "link": "https://www.engr.washington.edu/news/article/2025-11-10/detecting-diabetes-earlier"
        }
    },
    {
        "date": "10-28-2025",
        "description": "I gave a talk \"Learning to Collect: a Two-Stage Data Collection Framework for Data-Efficient Personalization\" at INFORMS 2025."
    },
     {
        "date": "10-28-2025",
        "description": "I gave a talk \"Bayesian Active Learning by Confidence Gradient-Based Mean Objective Cost of Uncertainty\" at my chaired session at INFORMS 2025."
    },
    {
        "date": "10-28-2025",
        "description": "I chaired a session at INFORMS 2025 titled \"Integration of Human, Knowledge and Systems for Quality and Personalized Decision-making\". Our speakers include Dr. Guoyan Li (Senior Data Scientist at Coherent Corp.), Dr. Menghan Liu (Assistant Professor of Instruction at University of Iowa), myself, Hanming Zhao (Ph.D. student at City University of Hong Kong), Dr. Alan Vazquez (Assistant Professor at Tecnologico de Monterrey). Thanks for their interesting and inspiring talks! Thanks to our co-chairs Dr. Alan Vazquez, Hanming Zheng and Dr. Jiajing Huang, for co-organizing the session!"
    },
    {
        "date": "10-27-2025",
        "description": "Our \"CrowdLLM\" paper won the Honorable Mention (Runner-up) in the 2025 INFORMS QSR Best Paper Competition. Huge congratulations to our team and thanks all my coauthors for the great efforts!"
    },
    {
        "date": "10-26-2025",
        "description": "I presented our paper \"CrowdLLM: a Synthetic Crowd Simulator for Crowdsourcing with LLM Workers Augmented with Lightweight Generative Models\" in the 2025 INFORMS QSR Best Paper Competition."
    },
    {
        "date": "10-26-2025",
        "description": "I co-chaired a session with Dr. Jiajing Huang (Asssistant Professor at Kennesaw State University) at INFORMS 2025 titled \" Data-Driven vs. Rule-Based: Bridging the Gap for Real-World Applications\". Our speakers include Dr. Feng Ye (Assistant Professor at Clemson Universityy), Jieqiong Zhao (Asssistant Professor at Augusta University), Lingtao Chen (Ph.D. student at Kennesaw State University), Zakaria Elghazzali (Undergraduate student at Kennesaw State University), Nzubechukwu Ohalete (Ph.D. Candidate at Kennesaw State University). Thanks for their interesting and inspiring talks!"
    },
    {
        "date": "09-12-2025",
        "description": "Our CrowdLLM paper was selected as the finalist of the INFORMS QSR best paper competition. Congratulations!"
    },
    {
        "date": "09-06-2025",
        "description": "Thrilled to share my mentee Congjing Zhang has been awarded the Amazon Graduate Fellowship. Huge congratulations! This is a proud moment as a mentor to see such accomplishments recognized."
    },
    {
        "date": "10-22-2024",
        "description": "I chaired a session at INFORMS 2024 titled \"Integration of Human, Knowledge and Systems for Quality\". Our speakers include Dr. Jundi Liu (Assistant Professor at Iowa State University), Hanming Zheng (Ph.D. student at City University of Hong Kong), Dr. Hongru Du (Assistant Professor at University of Virginia, previsouly Ph.D. candidate at Johns Hopkins University), Dr. William Yang (Postdoc at Lawrence Livermore National Laboratory), Yating Fang (Ph.D. Candidate at Rutgers University). Thanks for their interesting and inspiring talks!"
    },
    {
        "date": "10-21-2024",
        "description": "I gave a talk \"Benchmarking Fairness of Genetic Risk Score Models for Early-stage Prediction of Type 1 Diabetes from the TEDDY study\" at INFORMS 2024."
    },
    {
        "date": "10-04-2024",
        "description": "Our FairCL paper got accepted by INFORMS Journal on Data Science."
    },

    {
        "date": "09-23-2024",
        "description": "I joined Meta as a visiting researcher for one year to work on decision-making problems in recommendation systems under the supervision of Dr. Ji Liu."
    },
    
    {
        "date": "09-24-2023",
        "description": "Our RobustLDT paper was accepted by IISE transactions."
    },
    {
        "date": "09-15-2023",
        "description": "Our FairCL paper was selected as the finalist of INFORMS QSR best paper competition. Congratulations!"
    }
]
