[
    {
        "date": "10-07-2025",
        "description": "I gave a talk \"Create a Digital Population at Scale with Large Language Models (LLMs) and Generative AI through the CrowdLLM Framework\" at the UW ISE seminar."
    },
    {
        "date": "09-12-2025",
        "description": "Our CrowdLLM paper was selected as the finalist of the INFORMS QSR best paper competition. Congratulations!"
    },
    {
        "date": "09-06-2025",
        "description": "Thrilled to share my mentee Congjing Zhang has been awarded the Amazon Graduate Fellowship. Huge congratulations! This is a proud moment as a mentor to see such accomplishments recognized."
    },

    {
        "date": "10-22-2024",
        "description": "I chaired a session at INFORMS 2024 titled \"Integration of Human, Knowledge and Systems for Quality\". Our speakers include Dr. Jundi Liu (Asssistant Professor at Iowa State University), Hanming Zheng (Ph.D. student at City University of Hong Kong), Dr. Hongru Du (Assistant Professor at University of Virginia, previsouly Ph.D. candidate at Johns Hopkins University), Dr. William Yang (Postdoc at Lawrence Livermore National Laboratory), Yating Fang (Ph.D. Candidate at Rutgers University). Thanks for their interesting and inspiring talks!"
    },
    {
        "date": "10-21-2024",
        "description": "I gave a talk \"Benchmarking Fairness of Genetic Risk Score Models for Early-stage Prediction of Type 1 Diabetes from the TEDDY study\" at INFORMS 2024."
    },

    {
        "date": "10-04-2024",
        "description": "Our FairCL paper got accepted by INFORMS Journal on Data Science."
    },

    {
        "date": "09-23-2024",
        "description": "I joined Meta as a visiting researcher for one year to work on decision-making problems in recommendation systems under the supervision of Dr. Ji Liu."
    },
    
    {
        "date": "09-24-2023",
        "description": "Our RobustLDT paper was accepted by IISE transactions."
    },
    {
        "date": "09-15-2023",
        "description": "Our FairCL paper was selected as the finalist of INFORMS QSR best paper competition. Congratulations!"
    }

]
